openfoam2206/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/filmRegion/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1E-3;

pointSync false;

patches
(
    {
        name outlet;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f0;
    }
    {
        name side1;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f1;
    }
    {
        name inlet;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f2;
    }
    {
        name side2;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f3;
    }
);


// ************************************************************************* //
